Revit 2026 API

# SpatialElementBoundaryLocation Enumeration

---

An enumerated type listing boundary options of spatial element geometry calculation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SpatialElementBoundaryLocation
```
```vb
Public Enumeration SpatialElementBoundaryLocation
```
```cpp
public enum class SpatialElementBoundaryLocation
```
```fsharp
type SpatialElementBoundaryLocation
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 1 | Spatial element centerline. |
| CoreBoundary | 2 | Spatial element core boundary. |
| CoreCenter | 3 | Spatial element core center. |
| Finish | 0 | Spatial element finish face. |

#### Reference

Autodesk.Revit.DB Namespace